rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "nobody"]]
---
  def similar
    @movie = Movie.find params[:id]
    if @movie.director == ""
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to '/' and return
    end
    @movies = Movie.where(director: @movie.director)